%ªì©l¤Æ¯x°}E
E = zeros(4,5);
E(1,:) = [pi,-exp(1),2^(1/2),-(3^(1/2)),11^(1/2)];
E(2,:) = [pi^2,exp(1),(-1)*exp(2),3/7,0];
E(3,:) = [5^(1/2),-(6^(1/2)),1,-(2^(1/2)),pi];
E(4,:) = [pi^3,exp(2),-(7^(1/2)),1/9,2^(1/2)];
%Gauss Elimination
for i = 1:1:3
    for j = i+1:1:4
        temp = zeros(1,5);
        temp = E(j,:)-(E(j,i)/E(i,i).*E(i,:));
        E(j,:) = temp;
    end
end
%Backward substitution
x = zeros(4,1);
n = 4;
x(4,1) = E(4,5)/E(4,4);
x(3,1) = (E(3,5) - E(3,4)*x(4,1))/E(3,3);
x(2,1) = (E(2,5) - E(2,4)*x(4,1) - E(2,3)*x(3,1))/E(2,2);
x(1,1) = (E(1,5) - E(1,4)*x(4,1) - E(1,3)*x(3,1) - E(1,2)*x(2,1))/E(1,1);
fprintf(1,'prob1:');
x

clear all;
